; domain
(define (domain ai_game)
	(:requirements :strips :typing :fluents)
	(:types 	
		place - object		 
		person - object
		building - place
		forest - place
		resource - place		
	)
	
	(:functions
		(wood)
		(timber)
		(iron)
		(ore)
		(stone)
		(time)
	)
	
	(:predicates
		(at ?person - person ?p - place)
		(has-building ?p - place)
		
		(has-house ?p - place)
		(has-sawmill ?p - place)
		(has-smelter ?p - place)
		(has-school ?p - place)
		(has-storage ?p - place)
		(has-oremine ?p - place)
		(has-coalmine ?p - place)
		(has-quarry ?p - place)
		(has-blacksmith ?p - place)
		(has-barracks ?p - place)
		(has-skill ?person - person)
		(has-riflemanskill ?person - person)
		
		(ore_resource ?p - place)
		(coal_resource ?p - place)
		
		(has-turfhut ?p - place)
		
		(has-timber ?person - person)
		(has-wood ?person - person)
		(has-coal ?person - person)
		(has-ore ?person - person)
		(has-iron ?person - person)
		(has-stone ?person - person)
		(has-axe ?person - person)
		
		(stored-timber ?storage - place)

		(is-carpenter ?person - person)
		(is-blacksmith ?person - person)
		(is-lumberjack ?person - person)
		(is-teacher ?person - person)
		(is-miner ?person - person)
		(is-rifleman ?person - person)			
	)
	
	;; ------------- ACTIONS ---------- ;;
	
	(:action move
			:parameters (?person - person ?pl-from ?pl-to - place)
			:precondition (and (at ?person ?pl-from))
			:effect(and(at ?person ?pl-to) (not (at ?person ?pl-from)))
	)

	;;------------- Training ------------- ;;
	
	(:action simpleEducate
			:parameters(?person - person ?student - person ?place - place)
			:precondition(and(at ?person ?place) (at ?student ?place) (not(has-skill ?student)) (not(= ?person ?student)))
			:effect(and (has-skill ?student) (increase (time) 100))
	)
	
	(:action schoolEducate
			:parameters(?student - person ?teacher - person ?place - place)
			:precondition(and(at ?student ?place) (at ?teacher ?place) (is-teacher ?teacher) (has-school ?place) (not(has-skill ?student)))
			:effect(and (has-skill ?student) (increase (time) 50))
	)
	
	(:action barracksEducate
			:parameters(?student - person ?teacher - person ?place - place)
			:precondition(and(at ?student ?place) (at ?teacher ?place) (is-teacher ?teacher) (has-barracks ?place))
			:effect(and (has-riflemanskill ?student))
	)
	
	(:action trainCarpenter
			:parameters(?person - person)
			:precondition(and(has-skill ?person) (not(is-carpenter ?person)))
			:effect(and (is-carpenter ?person) (not(has-skill ?person)))
	)
	
	(:action trainBlacksmith
			:parameters(?person - person)
			:precondition(and(has-skill ?person) (not(is-blacksmith ?person)))
			:effect(and (is-blacksmith ?person) (not(has-skill ?person)))
	)
	
	(:action trainLumberjack
			:parameters(?person - person)
			:precondition(and(has-skill ?person) (not(is-lumberjack ?person)))
			:effect(and (is-lumberjack ?person) (not(has-skill ?person)))
	)
	
	(:action trainTeacher
			:parameters(?person - person)
			:precondition(and(has-skill ?person) (not(is-teacher ?person)))
			:effect(and (is-teacher ?person) (not(has-skill ?person)))
	)

	(:action trainMiner
			:parameters(?person - person)
			:precondition(and(has-skill ?person) (not(is-miner ?person)))
			:effect(and (is-miner ?person) (not(has-skill ?person)))
	)
	
	(:action trainRifleman
			:parameters(?person - person)
			:precondition(and(has-riflemanskill ?person) (not(is-rifleman ?person)))
			:effect(and (is-rifleman ?person) (not(has-riflemanskill ?person)))
	)
	
	;; --------- Acquire Resource --------- ;;
	
	(:action cutTree
			:parameters(?lumberjack - person ?tree - forest)
			:precondition(and(is-lumberjack ?lumberjack) (at ?lumberjack ?tree))
			:effect(has-timber ?lumberjack)
	)
	
	(:action mineOre
			:parameters(?miner - person ?mine - place)
			:precondition(and(is-miner ?miner) (at ?miner ?mine) (has-oremine ?mine))
			:effect(has-ore ?miner)
	)
	
	(:action mineCoal
			:parameters(?miner - person ?mine - place)
			:precondition(and(is-miner ?miner) (at ?miner ?mine) (has-coalmine ?mine))
			:effect(has-coal ?miner)
	)

	(:action cutStone
			:parameters(?stonecutter - person ?quarry - place)
			:precondition(and(at ?stonecutter ?quarry) (has-quarry ?quarry))
			:effect(has-stone ?stonecutter)
	)
	
	
	(:action produceWood
			:parameters(?person - person ?sawmill - place)
			:precondition(and(has-timber ?person) (at ?person ?sawmill) (has-sawmill ?sawmill))
			:effect(and(has-wood ?person) (not(has-timber ?person)))
	)
	
	(:action produceIron
			:parameters(?person - person ?smelter - place)
			:precondition(and(has-coal ?person) (has-ore ?person) (at ?person ?smelter) (has-smelter ?smelter))
			:effect(and(has-iron ?person) (not(has-coal ?person)) (not(has-ore ?person)))
	)
	
	(:action makeTool
			:parameters(?blacksmith - person ?place - place)
			:precondition(and(at ?blacksmith ?place) (is-blacksmith ?blacksmith) (has-smelter ?place))
			:effect(has-axe ?blacksmith)
	)
	
	;; --------- Build Building ---------- ;;
	
	(:action buildTurfHut
			:parameters(?person - person ?place - place)
			:precondition(and(at ?person ?place) (not(has-turfhut ?place)) (not(has-building ?place)))
			:effect(and(has-turfhut ?place) (has-building ?place))
	)
	
	(:action buildHouse
			:parameters(?carpenter - person ?person - person ?place - place)
			:precondition(and(at ?carpenter ?place) (at ?person ?place) (is-carpenter ?carpenter) (not(has-house ?place)) (not(has-building ?place)) (not(= ?person ?carpenter))
						  (or(has-wood ?carpenter) (has-wood ?person)))
			:effect(and(has-house ?place) (has-building ?place) (not(has-wood ?carpenter)) (not(has-wood ?person)))
	)
	
	(:action buildSmelter
			:parameters(?person - person ?place - place)
			:precondition(and(at ?person ?place) (has-stone ?person) (not(has-smelter ?place)) (not(has-building ?place)))
			:effect(and(has-smelter ?place) (has-building ?place) (not(has-stone ?person)))
	)
	
	(:action buildSchool
			:parameters(?carpenter - person ?person - person ?place - place)
			:precondition(and(at ?person ?place) (at ?carpenter ?place) (is-carpenter ?carpenter) (not(has-school ?place)) (not(has-building ?place)) (not(= ?person ?carpenter))
						  (or(has-wood ?carpenter) (has-wood ?person))
						  (or(has-iron ?carpenter) (has-iron ?person)))
			:effect(and(has-school ?place) (has-building ?place) (not(has-wood ?person)) (not(has-wood ?carpenter)) (not(has-iron ?person)) (not(has-iron ?carpenter)))
	)
	
	(:action buildSawMill
			:parameters(?person - person ?place - place)
			:precondition(and(at ?person ?place) (has-timber ?person) (has-stone ?person) (has-iron ?person) (not(has-building ?place)) (not(has-sawmill ?place)))
			:effect(and(has-sawmill ?place) (has-building ?place) (not(has-timber ?person)) (not(has-stone ?person)) (not(has-iron ?person)))
	)
	
	(:action buildOreMine
			:parameters(?carpenter - person ?blacksmith - person ?person - person ?resource - resource)
			:precondition(and(is-carpenter ?carpenter) (is-blacksmith ?blacksmith) (at ?carpenter ?resource) (at ?blacksmith ?resource) (ore_resource ?resource) (not(= ?carpenter ?blacksmith)) (not(has-oremine ?resource))
						(or(has-timber ?carpenter) (has-timber ?person)))
			:effect(and(has-oremine ?resource) (has-building ?resource))
	)
	
	(:action buildCoalMine
			:parameters(?carpenter - person ?blacksmith - person ?person - person ?resource - resource)
			:precondition(and(is-carpenter ?carpenter) (is-blacksmith ?blacksmith) (at ?carpenter ?resource) (at ?blacksmith ?resource) (coal_resource ?resource) (not (= ?carpenter ?blacksmith)) (not(has-coalmine ?resource))
						(or(has-timber ?carpenter) (has-timber ?blacksmith) (has-timber ?person)))
			:effect(and(has-coalmine ?resource) (has-building ?resource))
	)
			
	
	
		
	
	;; --------- Store Resource ---------- ;;
	
	(:action storeTimber
			:parameters(?person - person ?storage - place)
			:precondition(and(at ?person ?storage) (has-storage ?storage) (has-timber ?person))
			:effect(and (stored-timber ?storage) (increase (wood) 1))
	)
			
)

; problem
(define (problem test_problem)
	(:domain ai_game)
	
	(:objects
		
		person1 - person
		person2 - person
		person3 - person
		
		place1 - place
		place2 - place	
		place3 - place
		quarry - place		
		coalmine - place
		oreresource - resource
		coalresource - resource

		forest1 - forest
	)
	
	(:init
		
		(at person1 place1)
		(at person2 place2)	
		(has-quarry quarry)					
		(has-building quarry)
		(ore_resource oreresource)
		(coal_resource coalresource)
		(has-building oreresource)
		(has-building coalresource)
		(= (time) 0)		
	)
	
	(:goal
		
		(and
			(has-school place3)	
			(has-school place2)
		)
	)
)

; plan
1. (move person2 place2 forest1)
   deleted: (at person2 place2)
   added: (at person2 forest1)
   goals met: 0 of 2
2. (move person1 place1 quarry)
   deleted: (at person1 place1)
   added: (at person1 quarry)
   goals met: 0 of 2
3. (move person2 forest1 quarry)
   deleted: (at person2 forest1)
   added: (at person2 quarry)
   goals met: 0 of 2
4. (simpleeducate person2 person1 quarry)
   added: (has-skill person1)
   changed: (time) from 0 to 100
   goals met: 0 of 2
5. (simpleeducate person1 person2 quarry)
   added: (has-skill person2)
   changed: (time) from 100 to 200
   goals met: 0 of 2
6. (cutstone person2 quarry)
   added: (has-stone person2)
   goals met: 0 of 2
7. (move person1 quarry place3)
   deleted: (at person1 quarry)
   added: (at person1 place3)
   goals met: 0 of 2
8. (move person2 quarry place3)
   deleted: (at person2 quarry)
   added: (at person2 place3)
   goals met: 0 of 2
9. (trainlumberjack person2)
   deleted: (has-skill person2)
   added: (is-lumberjack person2)
   goals met: 0 of 2
10. (traincarpenter person1)
   deleted: (has-skill person1)
   added: (is-carpenter person1)
   goals met: 0 of 2
11. (simpleeducate person1 person2 place3)
   added: (has-skill person2)
   changed: (time) from 200 to 300
   goals met: 0 of 2
12. (move person2 place3 forest1)
   deleted: (at person2 place3)
   added: (at person2 forest1)
   goals met: 0 of 2
13. (trainminer person2)
   deleted: (has-skill person2)
   added: (is-miner person2)
   goals met: 0 of 2
14. (move person1 place3 coalresource)
   deleted: (at person1 place3)
   added: (at person1 coalresource)
   goals met: 0 of 2
15. (buildsmelter person2 forest1)
   deleted: (has-stone person2)
   added: (has-smelter forest1) (has-building forest1)
   goals met: 0 of 2
16. (cuttree person2 forest1)
   added: (has-timber person2)
   goals met: 0 of 2
17. (move person2 forest1 quarry)
   deleted: (at person2 forest1)
   added: (at person2 quarry)
   goals met: 0 of 2
18. (cutstone person2 quarry)
   added: (has-stone person2)
   goals met: 0 of 2
19. (move person2 quarry coalresource)
   deleted: (at person2 quarry)
   added: (at person2 coalresource)
   goals met: 0 of 2
20. (simpleeducate person1 person2 coalresource)
   added: (has-skill person2)
   changed: (time) from 300 to 400
   goals met: 0 of 2
21. (trainblacksmith person2)
   deleted: (has-skill person2)
   added: (is-blacksmith person2)
   goals met: 0 of 2
22. (buildcoalmine person1 person2 person3 coalresource)
   added: (has-coalmine coalresource)
   goals met: 0 of 2
23. (move person1 coalresource oreresource)
   deleted: (at person1 coalresource)
   added: (at person1 oreresource)
   goals met: 0 of 2
24. (move person2 coalresource oreresource)
   deleted: (at person2 coalresource)
   added: (at person2 oreresource)
   goals met: 0 of 2
25. (buildoremine person1 person2 person2 oreresource)
   added: (has-oremine oreresource)
   goals met: 0 of 2
26. (mineore person2 oreresource)
   added: (has-ore person2)
   goals met: 0 of 2
27. (move person1 oreresource place3)
   deleted: (at person1 oreresource)
   added: (at person1 place3)
   goals met: 0 of 2
28. (move person2 oreresource coalresource)
   deleted: (at person2 oreresource)
   added: (at person2 coalresource)
   goals met: 0 of 2
29. (minecoal person2 coalresource)
   added: (has-coal person2)
   goals met: 0 of 2
30. (move person2 coalresource forest1)
   deleted: (at person2 coalresource)
   added: (at person2 forest1)
   goals met: 0 of 2
31. (produceiron person2 forest1)
   deleted: (has-coal person2) (has-ore person2)
   added: (has-iron person2)
   goals met: 0 of 2
32. (move person2 forest1 coalmine)
   deleted: (at person2 forest1)
   added: (at person2 coalmine)
   goals met: 0 of 2
33. (buildsawmill person2 coalmine)
   deleted: (has-timber person2) (has-stone person2) (has-iron person2)
   added: (has-sawmill coalmine) (has-building coalmine)
   goals met: 0 of 2
34. (move person2 coalmine coalresource)
   deleted: (at person2 coalmine)
   added: (at person2 coalresource)
   goals met: 0 of 2
35. (minecoal person2 coalresource)
   added: (has-coal person2)
   goals met: 0 of 2
36. (move person2 coalresource oreresource)
   deleted: (at person2 coalresource)
   added: (at person2 oreresource)
   goals met: 0 of 2
37. (mineore person2 oreresource)
   added: (has-ore person2)
   goals met: 0 of 2
38. (move person2 oreresource forest1)
   deleted: (at person2 oreresource)
   added: (at person2 forest1)
   goals met: 0 of 2
39. (cuttree person2 forest1)
   added: (has-timber person2)
   goals met: 0 of 2
40. (produceiron person2 forest1)
   deleted: (has-coal person2) (has-ore person2)
   added: (has-iron person2)
   goals met: 0 of 2
41. (move person2 forest1 coalmine)
   deleted: (at person2 forest1)
   added: (at person2 coalmine)
   goals met: 0 of 2
42. (producewood person2 coalmine)
   deleted: (has-timber person2)
   added: (has-wood person2)
   goals met: 0 of 2
43. (move person2 coalmine place3)
   deleted: (at person2 coalmine)
   added: (at person2 place3)
   goals met: 0 of 2
44. (buildschool person1 person2 place3)
   deleted: (has-wood person2) (has-iron person2)
   added: (has-school place3) (has-building place3)
   goals met: 1 of 2
45. (move person2 place3 coalresource)
   deleted: (at person2 place3)
   added: (at person2 coalresource)
   goals met: 1 of 2
46. (move person1 place3 place2)
   deleted: (at person1 place3)
   added: (at person1 place2)
   goals met: 1 of 2
47. (minecoal person2 coalresource)
   added: (has-coal person2)
   goals met: 1 of 2
48. (move person2 coalresource oreresource)
   deleted: (at person2 coalresource)
   added: (at person2 oreresource)
   goals met: 1 of 2
49. (mineore person2 oreresource)
   added: (has-ore person2)
   goals met: 1 of 2
50. (move person2 oreresource forest1)
   deleted: (at person2 oreresource)
   added: (at person2 forest1)
   goals met: 1 of 2
51. (cuttree person2 forest1)
   added: (has-timber person2)
   goals met: 1 of 2
52. (produceiron person2 forest1)
   deleted: (has-coal person2) (has-ore person2)
   added: (has-iron person2)
   goals met: 1 of 2
53. (move person2 forest1 coalmine)
   deleted: (at person2 forest1)
   added: (at person2 coalmine)
   goals met: 1 of 2
54. (producewood person2 coalmine)
   deleted: (has-timber person2)
   added: (has-wood person2)
   goals met: 1 of 2
55. (move person2 coalmine place2)
   deleted: (at person2 coalmine)
   added: (at person2 place2)
   goals met: 1 of 2
56. (buildschool person1 person2 place2)
   deleted: (has-wood person2) (has-iron person2)
   added: (has-school place2) (has-building place2)
   goals met: 2 of 2
